---
layout: post
title: Redis
---

### Redis

- Redis is a key-value store, a data structures server, supporting different kinds of values.
- While in traditional key-value stores you associated string keys to string values,
- in Redis the value is not limited to a simple string, but can also hold more complex data structures.

### Data structures

- Binary-safe strings.

- Hashes, which are maps composed of fields(str) associated with values(str).(similar to Ruby or Python hashes).

### Redis keys

- "user:1000:followers"
- For instance "object-type:id" is a good idea, as in "user:1000".
-  Dots or dashes are often used for multi-word fields, as in "comment:1234:reply.to" or "comment:1234:reply-to".
- The maximum allowed key size is 512 MB.

### Redis strings

- the only data type in Memcached
- caching HTML fragments or pages

```
> set mykey somevalue [nx / xx]
OK
> get mykey
"somevalue"

> incr / incrby  # atomic
> decr / decrby

# Altering and querying the key space
> exists mykey
(integer) 1
> del mykey
(integer) 1
> exists mykey
(integer) 0

> type mykey
string
> del mykey
(integer) 1
> type mykey
none
```

- Value can be strings (including binary data) of every kind(store a jpeg image inside a value). Itcan't be bigger than 512 MB.
- The ability to set or retrieve the value of multiple keys in a single command is also useful for reduced latency.

```
> mset a 10 b 20 c 30
OK
> mget a b c # return an array of values
```

### Redis expires: keys with limited time to live

- When the time to live elapses, the key is automatically destroyed(DEL).

```
> set key some-value
OK
> expire key 5
(integer) 1
> get key (immediately)
"some-value"
> get key (after some time)
(nil)

> set key 100 ex 10
OK
> ttl key # time to live
(integer) 9
```

### Redis lists

- "Python Lists" are not what the name may suggest (Linked Lists), but rather Arrays (the same data type is called Array in Ruby actually).

- Lists: collections of string elements sorted according to the order of insertion.
- They are implemented via Linked Lists. This means that even if you have millions of elements inside a list, the operation of adding a new element in the head or in the tail of the list is performed in "constant time".

- for a database system / add elements / fast

```
> rpush mylist A
(integer) 1
> rpush mylist B
(integer) 2
> lpush mylist first
(integer) 3
> lrange mylist 0 -1
1) "first"
2) "A"
3) "B"

> rpush mylist 1 2 3 4 5 "foo bar"
(integer) 9

# retrieving the element and eliminating it from the list
> rpush mylist a b c
(integer) 3
> rpop mylist
"c"
> rpop mylist
"b"
> rpop mylist
"a"

# Redis returned a NULL value to signal that there are no elements in the list.
> rpop mylist
(nil)
```

- Common use cases for lists

- Capped lists

```
> rpush mylist 1 2 3 4 5
(integer) 5
> ltrim mylist 0 2
OK
> lrange mylist 0 -1
1) "1"
2) "2"
3) "3"
```

### Redis sets

- Sets: collections of unique, unsorted string elements.

```
> sadd myset 1 2 3
(integer) 3
> smembers myset
1. 3
2. 1
3. 2

# checking if an element exists
> sismember myset 3
(integer) 1
> sismember myset 30
(integer) 0
```

- Sorted sets
  - Every string element is associated to a floating number value(score).
  - Sorted by their score, it can retrieve a range of elements (give me the top 10 or the bottom 10).
  - They are a data type which is similar to a mix between a Set and a Hash.
  -  A and B strings can't be equal in the sorted sets.

```
# sorted by birth year
> zadd hackers 1940 "Alan Kay"
(integer) 1
> zadd hackers 1957 "Sophie Wilson"
(integer) 1

> zrange hackers 0 -1 / zrevrange [withscores]
1) "Alan Turing"
2) "Sophie Wilson"

# between negative infinity and 1950 (both extremes are included)
> zrangebyscore hackers -inf 1950
1) "Alan Turing"

# remove
> zremrangebyscore hackers 1940 1960

```




### Link

- [Install redis on EC2 Amazon linux AMI / The latest stable Redis version](https://gist.github.com/ambuilding/1fd59869f8944f2eb834eb42cb5e470c)
- [Redis Quick Start](https://redis.io/topics/quickstart)
- [Install Redis v3.2 on AWS EC2 Instance](https://medium.com/@andrewcbass/install-redis-v3-2-on-aws-ec2-instance-93259d40a3ce)
